In [3]:
import pandas as pd

In [4]:
pwd

'c:\\Users\\user\\OneDrive\\Documents\\GitHub\\TEK\\ML-DS\\practices\\pandas'

In [5]:
ls

 Volume in drive C is OS
 Volume Serial Number is 8A59-8836

 Directory of c:\Users\user\OneDrive\Documents\GitHub\TEK\ML-DS\practices\pandas

30-07-2023  12:15    <DIR>          .
25-07-2023  07:55    <DIR>          ..
29-07-2023  14:30            50,940 combiningDataFrames.ipynb
23-07-2023  22:25            71,734 Data_filtering.ipynb
23-07-2023  10:54           214,460 Dataframes.ipynb
01-08-2023  22:09             5,542 excel.xlsx
28-07-2023  07:17           250,320 groupByOprs..ipynb
01-08-2023  22:19            32,385 ipop.ipynb
25-07-2023  07:43            53,162 missingData.ipynb
20-07-2023  06:31               177 movie_scores.csv
01-08-2023  22:09                51 newFile.csv
01-08-2023  22:09             1,582 sampleTable.html
22-07-2023  07:40            13,484 Series.ipynb
29-07-2023  15:13             7,928 textMethodsonString.ipynb
30-07-2023  10:30            75,703 timeMethods.ipynb
20-07-2023  06:31            18,752 tips.csv
25-07-2023  06:57           158,153 usefulMethods.ipynb
              15 File(s)        954,373 bytes
               2 Dir(s)  110,268,780,544 bytes free

In [6]:
import os

In [7]:
os.getcwd()

'c:\\Users\\user\\OneDrive\\Documents\\GitHub\\TEK\\ML-DS\\practices\\pandas'

In [8]:
df = pd.read_csv('../ML_NoteBook/03-Pandas/example.csv', index_col=0)

In [9]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [10]:
df.to_csv('newFile.csv',index=True)

In [11]:
df2 = pd.read_csv('newFile.csv')

In [12]:
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Input and Output HTML Tebles

In [13]:
import pandas as pd

In [14]:
url = 'https://en.wikipedia.org/wiki/World_population'

In [15]:
table = pd.read_html(url)

In [16]:
len(table)

29

In [17]:
table[0]

,Population,1,2,3,4,5,6,7,8,9,10
0,Year,1804,1930,1960,1974,1987,1999,2011,2022,2037,2057
1,Years elapsed,"200,000+",126,30,14,13,12,12,11,15,20

In [18]:
table[1]

,Region,2022 (percent),2030 (percent),2050 (percent)
0,Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
1,Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
2,Central and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
3,Eastern and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
4,Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"
5,Latin America and the Caribbean,658 (8.29%),695 (8.17%),749 (7.73%)
6,Australia/New Zealand,31 (0.39%),34 (0.40%),38 (0.39%)
7,Other Oceania,14 (0.18%),15 (0.18%),20 (0.21%)
8,World,7942,8512,9687

In [19]:
table[1].columns

Index(['Region', '2022 (percent)', '2030 (percent)', '2050 (percent)'], dtype='object')

In [20]:
areaPopulation = table[1].set_index('Region')

In [21]:
areaPopulation

,2022 (percent),2030 (percent),2050 (percent)
Region,,,
Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
Central and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
Eastern and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"
Latin America and the Caribbean,658 (8.29%),695 (8.17%),749 (7.73%)
Australia/New Zealand,31 (0.39%),34 (0.40%),38 (0.39%)
Other Oceania,14 (0.18%),15 (0.18%),20 (0.21%)
World,7942,8512,9687

In [22]:
areaPopulation.drop('World', axis=0)

,2022 (percent),2030 (percent),2050 (percent)
Region,,,
Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
Central and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
Eastern and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"
Latin America and the Caribbean,658 (8.29%),695 (8.17%),749 (7.73%)
Australia/New Zealand,31 (0.39%),34 (0.40%),38 (0.39%)
Other Oceania,14 (0.18%),15 (0.18%),20 (0.21%)

In [23]:
areaPopulation.to_html('sampleTable.html', index=True)

Input and Output : Excel Files

In [24]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\user\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\user\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [25]:
pip install xlrd

Requirement already satisfied: xlrd in c:\users\user\anaconda3\lib\site-packages (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [26]:
import pandas as pd

In [27]:
df = pd.read_excel('../ML_NoteBook/03-Pandas/my_excel_file.xlsx')

In [28]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [29]:
df2 = pd.ExcelFile('../ML_NoteBook/03-Pandas/my_excel_file.xlsx')

In [30]:
df2

In [31]:
df2.sheet_names

['First_Sheet']

In [32]:
excel_sheet_dict = pd.read_excel('../ML_NoteBook/03-Pandas/my_excel_file.xlsx', sheet_name=None)

In [36]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [34]:
df3=excel_sheet_dict['First_Sheet']

In [35]:
df.to_excel('excel.xlsx',sheet_name='First_Sheet')

Input and Output in SQL

In [37]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\user\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy) (1.1.1)
Note: you may need to restart the kernel to use updated packages.

In [38]:
from sqlalchemy import create_engine

In [39]:
temp_db = create_engine('sqlite:///:memory:')